docs/corners/david/20211026122309-lens_quiz_prep.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-31 Sun 13:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lens Quiz Prep</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Lens Quiz Prep</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-10-31 Sun 12:53</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org0e8fef0">0.0.1. Lenses</a></li>
<li><a href="#orgf6f879a">0.0.2. Cameras</a></li>
<li><a href="#org7c3854e">0.0.3. Color</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb9b4e54">1. Prism dispersion</a></li>
<li><a href="#org3e96b0b">2. Aberration</a></li>
<li><a href="#orgf4e094b">3. Magnification</a></li>
<li><a href="#orgb6621cb">4. DoF</a></div></div>
</div>

<div id="outline-container-org0e8fef0" class="outline-4">
<h4 id="org0e8fef0"><span class="section-number-4">0.0.1</span> </h4>
<div class="outline-text-4" id="text-0-0-1">
<ul class="org-ul">
<li>Rays that go in parallel come out through focal point</li>
<li>Rays that go in through focal point come out parallel</li>
<li>Rays that come in through \(2f\) comes ou through \(2f\)</li>
<li>Thin Lens Equation: \(\frac{1}{f} = \frac{1}{d_o} + \frac{1}{d_i}\)</li>
<li>For a thin lens in air: \(\frac{1}{f} = (n-1)\left[ \frac{1}{R_1} - \frac{1}{R_2}\right]\) where \(R_1\) and \(R_2\) are the radii of curvature for each face of the lens and \(n\) the index of refraction of the lens. If \(R_1 = R_2\) (like some crescent shape) the light wouldn't focus (or it'd focus at infinity).</li>
</ul>

<p>
\(h_i = -\frac{d_i}{d_o}h_o\)
</p>
</div>
</div>

<div id="outline-container-orgf6f879a" class="outline-4">
<h4 id="orgf6f879a"><span class="section-number-4">0.0.2</span> </h4>
<div class="outline-text-4" id="text-0-0-2">
<ul class="org-ul">
<li>ISO: Range is usually from 100-25600. High ISO: noise (overall signal is lower so noise is higher relative to signal)</li>
<li>Aperture: <i>f-stop</i> is the <span class="underline">inverse</span> of the aperture. Aperture is \(f\) over the f-stop. At a f-stop of 2, aperture is \(\frac{50\text{mm}}{2} = 25\text{mm}\). Each f-stop lets in twice as much light as the previous.</li>
<li>Shutter speed: Longer exposure lets more light hit the sensor. Higher exposure can capture more movement and vice versa. You can handhold 1/focal length and still get a sharp picture.</li>
<li>Sensor size: Larger sensor size is better image (more light can be captured, less noise). Large is expensive. Large also means no need to enlarge photo.</li>
<li>Histogram: Bins that represent how much of the image is how bright (rightmost is maxed out, leftmost is no light). If there's a spike on the left that means that a lot of the image is dark, and vice versa.</li>
</ul>
</div>
</div>
<div id="outline-container-org7c3854e" class="outline-4">
<h4 id="org7c3854e"><span class="section-number-4">0.0.3</span> </h4>
<div class="outline-text-4" id="text-0-0-3">
<ul class="org-ul">
<li>Color spaces
<ul class="org-ul">
<li>RGB: Red, green, and blue components on a scale from 0-255.</li>
<li>CMYK: Cyan, magenta, yellow, black components on a scale from 0-100.</li>
<li>HSV: Hue (color), saturation (vibrancy), value (darkness). Hue is a rainbow wrapped into a circle, so is 0-360 degrees. S and V are from 0 to 1.</li>
<li>LAB: Perception-based: scale of red-green and blue-yellow and perceptual brightness.</li>
</ul></li>
<li><b>Additive/subtractive colors</b>: in an <i>additive</i> space like RGB you start at black and adding more color brings you towards white, and in a <i>subtractive</i> space like CMYK you start at white and more colors darkens it towards black (not exactly, so K component).</li>
<li><b>Color solids</b>: map color scales to dimensions of a solid. RGB cube, HSL cylinder.</li>
<li><b>Color temperature</b>: temperature at which an ideal blackbody would emit that color. Blackbodies of different temperatures produce different spectrums, with high temp ones being spikier and bluer and low temp ones being flatter and redder. Human perception is very good at interpreting the true color of objects under tinted light, so cameras use shift color temperature (or "white balance") to attempt to match the colors to it.</li>
<li><b>Color in film</b>: Layers of material sensitive to specific colors: blue sensitive gets yellow, green-sensitive magenta, red-sensitive cyan. Negatives produced are the opposite colors.</li>
<li><b>Color in digital</b>: not every sensor gets all colors, instead use a grid with mostly green, some red, and some blue, and determine color value from neighbors (which assumes color is constant over small angular scales).</li>
</ul>
</div>
</div>

<div id="outline-container-orgb9b4e54" class="outline-2">
<h2 id="orgb9b4e54"><span class="section-number-2">1</span> Prism dispersion</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Refracted internal beam forms a triangle with the prism (which has known angles), allowing calculation via</li>
<li>\(\arcsin\left(\sin\left(90-\left(180 - \left(\sin^{-1}\left(\frac{\sin(x)}{n}\right)+60\right)\right)n\right)\)</li>
<li>Literally just use Snell's Law (\(\sin \theta_1 n_1 = \sin \theta_2 n_2\)) and geometry.</li>
</ul>
</div>
</div>

<div id="outline-container-org3e96b0b" class="outline-2">
<h2 id="org3e96b0b"><span class="section-number-2">2</span> Aberration</h2>
<div class="outline-text-2" id="text-2">
<p>
Ideally all rays from a point converge at a single image point - anything that stops this from happening is an <i>aberration</i>. Chromatic aberrations are due to the fact that lenses focus colors differently since its focal length is dependent on index of reflection (see Lensmaker's Eq) which varies w/ wavelength. There are a variety of other aberrations caused by slightly imparallel rays, lens defects, etc. Aberrations are counteracted by multi-lens systems.
</p>
</div>
</div>

<div id="outline-container-orgf4e094b" class="outline-2">
<h2 id="orgf4e094b"><span class="section-number-2">3</span> Magnification</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>\(h_i/h_o\) is <i>spatial</i> magnification</li>
<li>Ratio of image on aided to retina to unaided retina is <i>angular</i> magnification.
<ul class="org-ul">
<li>This is equivalent to the powerful lens / weaker lens in a two lens system? I think?</li>
<li>Size of image in eye is directly proportional to angle subtended from object, so becomes unaided subtended angle \(\alpha\) over aided subtended angle \(\beta\).</li>
<li>\(\alpha = \frac{h}{F_o}\) and \(\beta = \frac{h}{F_e}\), where \(h\) is height of internal real image, \(F_e\) focal length of eyepiece, and \(F_o\) focal length of objective lens. \(M = \frac{\beta}{\alpha} = \frac{F_o}{F_e}\). Alternatively, this can be thought of as the lower power lens over the higher power lens (where <i>power</i> is the inverse of the focal length and measured in inv meters aka diopters).</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb6621cb" class="outline-2">
<h2 id="orgb6621cb"><span class="section-number-2">4</span> DoF</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Choose an object of arbitary distance to focus at, set the \(d_i\), and then for objects of different \(d_o\) compare their \(d_i\), set up similar triangles to get blur.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
